app/controllers/animals_controller.rb

  def index
    @animal = Animal.all
---
SELECT "animals".* FROM "animals"

  def show
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @animal = Animal.new(animal_params)
    add_taxonomical_data(@animal)
    if @animal.save
---
INSERT INTO "animals" ("name", "legs", "poisonous", "warm_blooded", "created_at", "updated_at", "image_path") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Marmot"], ["legs", 4], ["poisonous", false], ["warm_blooded", false], ["created_at", 2016-09-07 01:15:12 UTC], ["updated_at", 2016-09-07 01:15:12 UTC], ["image_path", ""]]

  def edit
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @animal = Animal.find(params[:id])
    @animal.update(animal_params)
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "animals" SET "name" = $1, "image_path" = $2, "updated_at" = $3 WHERE "animals"."id" = $4  [["name", "Gecko"], ["image_path", "http://4.bp.blogspot.com/-_4YSL3AIp0o/Ue5zT_jUweI/AAAAAAAAoms/NQTKfJHMbSg/s640/tokay+gecko+2.jpg"], ["updated_at", 2016-09-07 01:13:48 UTC], ["id", 6]]

  def destroy
    @animal = Animal.find(params[:id])
    @animal.destroy
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 1]]